# <u>Student Performance Analysis</u>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [31]:
file_path = "E:\Jupyter\Masai BA/PROJECT_2/StudentsPerformance.csv"
df = pd.read_csv(file_path)
df.head()

<>:1: SyntaxWarning: invalid escape sequence '\J'
<>:1: SyntaxWarning: invalid escape sequence '\J'
C:\Users\himan\AppData\Local\Temp\ipykernel_25760\914090951.py:1: SyntaxWarning: invalid escape sequence '\J'
  file_path = "E:\Jupyter\Masai BA/PROJECT_2/StudentsPerformance.csv"

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [32]:
#create the 'student_id' column starting from 1
df.insert(0, 'student_id', range(1, len(df) + 1))

In [33]:
df.columns = [col.strip().lower().replace(" ", "_") for col in df.columns]
print("Dataset Info:")
df.info()

Dataset Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student_id                   1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental_level_of_education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test_preparation_course      1000 non-null   object
 6   math_score                   1000 non-null   int64
 7   reading_score                1000 non-null   int64
 8   writing_score                1000 non-null   int64
dtypes: int64(4), object(5)
memory usage: 70.4+ KB

In [34]:
#check missing values
print("No. of missing values:")
df.isnull().sum()

No. of missing values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [35]:
#check duplicate values
print("No. of duplicate values:")
df[df.duplicated()].sum()

No. of duplicate values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: object

In [36]:
#check blank values
print("No. of blank values:")
(df == ' ').sum()

No. of blank values:

student_id                     0
gender                         0
race/ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [37]:
print("Summary Statistics:")
df.describe()

Summary Statistics:

        student_id  math_score  reading_score  writing_score
count  1000.000000  1000.00000    1000.000000    1000.000000
mean    500.500000    66.08900      69.169000      68.054000
std     288.819436    15.16308      14.600192      15.195657
min       1.000000     0.00000      17.000000      10.000000
25%     250.750000    57.00000      59.000000      57.750000
50%     500.500000    66.00000      70.000000      69.000000
75%     750.250000    77.00000      79.000000      79.000000
max    1000.000000   100.00000     100.000000     100.000000

In [38]:
#total number of student
print(f"Total Students: {df.shape[0]}")

Total Students: 1000

In [39]:
df.head(10)

,student_id,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,1,female,group B,bachelor's degree,standard,none,72,72,74
1,2,female,group C,some college,standard,completed,69,90,88
2,3,female,group B,master's degree,standard,none,90,95,93
3,4,male,group A,associate's degree,free/reduced,none,47,57,44
4,5,male,group C,some college,standard,none,76,78,75
5,6,female,group B,associate's degree,standard,none,71,83,78
6,7,female,group B,some college,standard,completed,88,95,92
7,8,male,group B,some college,free/reduced,none,40,43,39
8,9,male,group D,high school,free/reduced,completed,64,64,67
9,10,female,group B,high school,free/reduced,none,38,60,50

In [40]:
df.to_csv('StudentsPerformance_cleaned.csv', index=False)
print("Cleaned DataFrame successfully saved to StudentsPerformance_cleaned.csv")

Cleaned DataFrame successfully saved to StudentsPerformance_cleaned.csv